var _TheArray = new Array();
_TheArray[0] = "1";
_TheArray[1] = "成功";
_TheArray[2] = "失败";
_TheArray[3] = "异常";
_TheArray[4] = "服务器错误";
_TheArray[11] = "申请成功，请等待管理员审核,我们会在一个工作日内联系您";
_TheArray[12] = "审核中，如需要修改资料请联系客服";
_TheArray[13] = "审核中，如需要修改资料请联系客服";
_TheArray[1001] = "添加成功";
_TheArray[1002] = "添加失败";
_TheArray[1003] = "添加失败,记录已存在,请检查编号和名称";
_TheArray[1004] = "添加失败,缺少父级或是空记录";
_TheArray[1011] = "编辑成功";
_TheArray[1012] = "编辑失败";
_TheArray[1013] = "编辑失败,记录已存在,请检查编号和名称";
_TheArray[1014] = "编辑失败,缺少父级或是空记录";
_TheArray[1101] = "登录成功";
_TheArray[1102] = "失败";
_TheArray[1103] = "没有这个账号";
_TheArray[1104] = "账号密码不正确";
_TheArray[1105] = "账号密码不能为空";
_TheArray[1106] = "账号待审核";
_TheArray[1107] = "账号已锁定";

_TheArray[1201] = "注册成功";
_TheArray[1202] = "注册失败";
_TheArray[1203] = "已有这个账号";
_TheArray[1204] = "注册验证码不正确";
_TheArray[1205] = "密码或用户名为空";
_TheArray[1206] = "间隔时间不超过1分钟";
_TheArray[1207] = "一天登录次数超过20次";
_TheArray[1208] = "您已注册成功了，请直接登录";
_TheArray[1209] = "手机号码已存在，如有疑问，请联系客服";
_TheArray[1210] = "验证码发送中，请稍候";
_TheArray[1211] = "注册验证码已过期";
_TheArray[1212] = "验证码不正确";
_TheArray[1213] = "手机号码不存在";



_TheArray[1301] = "密码不能为空";

_TheArray[1401] = "重复的名称";
_TheArray[1402] = "重复的公司名称";
_TheArray[1403] = "重复的店铺名称";
_TheArray[1404] = "收货地址数量太多了";
_TheArray[1405] = "亲，您的优惠券已过期了";

_TheArray[1501] = "亲,您的增票未审核，请联系客服";
_TheArray[1502] = "亲,您需要的产品已下架或库存不足，请从购物车重新下单";
_TheArray[1503] = "亲,发票抬头没有输入";

_TheArray[1601] = "亲,您的订单目前不能取消，请联系客服处理";
_TheArray[1602] = "亲,您的订单已取消，无需重复取消";
_TheArray[1603] = "订单不存在";
_TheArray[1604] = "当前订单不能进行此操作";

_TheArray[1701] = "亲,当前订单不能评论额";
_TheArray[1702] = "亲,当前订单已评论了";

